# Вычислить число π c заданной точностью d
num = int(input("точность округления: "))
pi = (1/16**0) * (4/(8 * 0 + 1) - 2/(8 * 0 + 4) - 1/(8 * 0 + 5) - 1/(8 * 0 + 6)) # Формула Бэйли — Боруэйна — Плаффа:

for x in range(1, num):
   pi += (1/16**x) * (4/(8 * x + 1) - 2/(8 * x + 4) - 1/(8 * x + 5) - 1/(8 * x + 6))
print(round(pi, num))